// функция возвращает остаток товара по переданной номенклатуре в виде соответствия, где ключ Склад и значение - количество
// возвращаемое значение - соответствие
// Пример использования:
// ОстатокТовара = РегистрыНакопления.ТоварыНаСкладе.ПолучитьОстатокТовара(Номенклатура);
//
// параметры:
// Номенклатура - ссылка на номенклатуру, по которой нужно получить остаток
//
// возвращаемое значение:
// соответствие, где ключ - Склад, значение - количество
//
//
Функция ПолучитьОстатокТовара(Номенклатура, Склады) Экспорт

	ОстатокТовара = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыНаСкладе.Склад КАК Склад,
	|	ТоварыНаСкладе.Количество КАК Количество
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладе.Остатки(, Номенклатура = &Номенклатура) КАК ТоварыНаСкладе
	|ГДЕ
	|	ТоварыНаСкладе.Номенклатура = &Номенклатура
	|	И ТоварыНаСкладе.Склад В (&Склады)";

	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склады);
	
	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОстатокТовара.Вставить(ВыборкаДетальныеЗаписи.Склад, ВыборкаДетальныеЗаписи.Количество);
	КонецЦикла;
	
	Возврат ОстатокТовара;

КонецФункции
```