
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстПользователю = "Изменилась количество";
	
	РассчитатьСуммуСтроки(ТекущиеДанные, ТекстПользователю);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстПользователю = "Изменилась цена";
	
	РассчитатьСуммуСтроки(ТекущиеДанные, ТекстПользователю);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуСтроки(Строка, Сообщение)
	Строка.Сумма = Строка.Цена * Строка.Количество;
	
	ТекстСообщения = Новый СообщениеПользователю();
	ТекстСообщения.Текст = Сообщение;
	ТекстСообщения.Сообщить();
	
КонецПроцедуры

// Описание сотрудника.
// 
// Возвращаемое значение:
//  Структура - Описание сотрудника:
// * Имя - Строка - 
// * ДатаРождения - Дата - 
// * Стаж - Число - 
// * Штатный - Булево - 
&НаКлиенте
Функция ОписаниеСотрудника()
	Сотрудник = Новый Структура;
	
	Сотрудник.Вставить("Имя", "Илья");
	Сотрудник.Вставить("ДатаРождения", ТекущаяДата());
	Сотрудник.Вставить("Стаж", 15);
	Сотрудник.Вставить("Штатный", Ложь);
	
	Возврат Сотрудник;
КонецФункции


Переменная1 = 1;
Переменная1 = "аа";
